# 商家端--评价管理

tags: comment_wq,p0

## 数据查询结果--评价内容
tags:p0_joan

* 萌推APP登录,通过手机号="15021721258"和验证码
* MMS商家登录,通过用户名="18017752229",密码="19660302,.cj"
* 创建待审核商品,商品价钱="10",mall_id="",goods_name=""
* OMS小二后台登录,通过手机号="wenjie"和密码="a1a1a1"
* OMS审核商品
* 直购下单,参数:商品id="",类目id="",支付方式="",店铺优惠券id="",平台优惠券id="",推币使用="",礼品卡使用=""
* 生成预支付订单并mock支付,order_id="",payment_method="",platform=""
* MMS订单发货,goods_id="",order_id=""
* 买家确认订单收货, order_id=""
* 买家/卖家添加订单评论, order_id=""
* 获得评价内容并做校验

## 回复和举报操作校验

* 回复操作校验
* 举报操作校验
* 新OMS小二后台登录,通过用户名="wenjie"和密码="a1a1a1"
* 萌推小二后台审核举报成功
