# 交易链路-结算页检查

tags:order_check,p0

* 萌推APP登录,通过手机号="15021721258"和验证码

## 新增,切换地址检查
tags:settle

* 新增地址检查
* 进行地址切换,地址切换成功检查

## 检查订单结算页正确展示店铺信息和商品信息

* 店铺信息v2, mall_id="100003"
* 商品详情页的接口v2, goods_id="12008"
* 检查订单结算页正确展示店铺信息和商品信息

## 直购下单,支付宝能否支付成功,检查实付金额为售价减各种优惠
tags:order-joan

* 直购下单,参数:商品id="12008",类目id="",支付方式="3",店铺优惠券id="",平台优惠券id="",推币使用="",礼品卡使用=""
* 获取订单v2_get, order_status="0", size="20"
* 生成预支付订单并mock支付,order_id="",payment_method="3",platform="50"

## 直购下单,花呗能否支付成功,检查实付金额为售价减各种优惠

* 直购下单,参数:商品id="12008",类目id="",支付方式="9",店铺优惠券id="",平台优惠券id="",推币使用="",礼品卡使用=""
* 生成预支付订单并mock支付,order_id="",payment_method="9",platform="50"
